{
  "title": "FRC Curriculum Overview",
  "sections": [
    {
      "type": "text",
      "title": "Welcome to FRC Programming",
      "content": "Welcome to the FRC programming curriculum. This guide takes you from a complete beginner to an advanced programmer, covering the WPILib framework, Command-Based programming, control theory, and professional development practices."
    },
    {
      "type": "rules-box",
      "title": "Important Disclaimer",
      "subtitle": "Official Documentation",
      "items": [
        "This curriculum is a learning guide, not a rulebook.",
        "Always refer to official FRC and WPILib documentation for the most up-to-date rules and APIs.",
        "Safety first: Always follow safety procedures when working with physical robots."
      ]
    },
    {
      "type": "text",
      "title": "Curriculum Structure",
      "content": "The curriculum is divided into tiered modules to guide your learning journey:<br><br><strong>1. Environment Setup:</strong> Installing tools (VS Code, WPILib, Driver Station) and understanding the project structure.<br><strong>2. Basics:</strong> Motor control, reading sensors, and handling joystick inputs.<br><strong>3. Command-Based Programming:</strong> The industry-standard architecture for FRC robots, separating hardware from logic.<br><strong>4. Control Theory:</strong> PID control, feedforward, and motion profiling for smooth, accurate movement.<br><strong>5. Pose Estimation:</strong> Tracking your robot's position on the field using odometry and vision.<br><strong>6. Advanced Topics:</strong> Simulation, unit testing, and path planning."
    },
    {
      "type": "link-grid",
      "title": "Start Learning",
      "links": [
        {
          "label": "Environment Setup",
          "id": "environment-setup"
        },
        {
          "label": "Intro to Motors",
          "id": "intro-to-motors"
        },
        {
          "label": "Command-Based Guide",
          "id": "intro-to-command-based"
        }
      ]
    }
  ]
}