{
  "title": "Advanced Control",
  "sections": [
    {
      "type": "text",
      "title": "Overview",
      "content": "Beyond PID, advanced control techniques like State-Space, LQR, and Feedforward offer superior performance for complex systems. These are useful for multi-joint arms, swerve drives, or systems requiring high precision."
    },
    {
      "type": "rules-box",
      "title": "Techniques",
      "subtitle": "Key concepts:",
      "items": [
        "<strong>State-Space:</strong> Models systems using state variables (position, velocity) and matrix equations.",
        "<strong>LQR (Linear Quadratic Regulator):</strong> Optimal control that balances error reduction with control effort.",
        "<strong>Feedforward:</strong> Predicts required output based on physics models (gravity, friction, inertia).",
        "<strong>MIMO:</strong> Multi-Input Multi-Output control for coupled systems (e.g., Swerve)."
      ]
    },
    {
      "type": "text",
      "title": "State-Space Control",
      "content": "Uses the equation <code>ẋ = Ax + Bu</code> to model how system state changes. This allows controlling multiple coupled variables (like arm angle and velocity) simultaneously. WPILib provides <code>LinearSystem</code> and <code>LinearSystemLoop</code> for implementation."
    },
    {
      "type": "text",
      "title": "LQR (Optimal Control)",
      "content": "LQR finds the 'best' control gains by minimizing a cost function. You tune <strong>Q</strong> (penalty for error) and <strong>R</strong> (penalty for effort).<br>High Q = aggressive correction.<br>High R = smooth/efficient motion."
    },
    {
      "type": "text",
      "title": "When to Use",
      "content": "<strong>PID:</strong> Sufficient for 90% of FRC mechanisms (shooters, simple arms, intakes).<br><strong>Advanced Control:</strong> Needed for inverted pendulums, balancing robots, or highly coupled multi-joint arms."
    },
    {
      "type": "link-grid",
      "title": "Resources",
      "links": [
        {
          "label": "WPILib State-Space",
          "url": "https://docs.wpilib.org/en/stable/docs/software/advanced-controls/state-space/index.html"
        },
        {
          "label": "PID Control",
          "id": "frc-pid-control"
        }
      ]
    }
  ]
}
