{
  "id": "homepage",
  "title": "Welcome to Mantik",
  "description": "Comprehensive programming training platform for robotics teams",
  "sections": [
    {
      "type": "text",
      "title": "",
      "content": "ㅤㅤㅤㅤ"
    },
    {
      "type": "text",
      "title": "Choose Your Learning Path",
      "content": "Welcome to Mantik! This comprehensive training platform is designed to help you master programming concepts for robotics competitions. Select the training path that best fits your needs and experience level."
    },
    {
      "type": "link-grid",
      "title": "Training Sections:",
      "links": [
        {
          "label": "Java Training",
          "id": "java-training",
          "icon": "☕",
          "description": "Master Java programming fundamentals"
        },
        {
          "label": "FTC Training",
          "id": "ftc-specific",
          "icon": "🤖",
          "description": "FIRST Tech Challenge programming"
        },
        {
          "label": "FRC Training",
          "id": "frc-specific",
          "icon": "🏁",
          "description": "FIRST Robotics Competition programming"
        },
        {
          "label": "Competitive Training",
          "id": "competitive-training",
          "icon": "🏆",
          "description": "Competitive programming strategies"
        }
      ]
    },
    {
      "type": "text",
      "title": "About Each Section:",
      "content": "<ul>\n  <li><strong>Java Training:</strong> Master Java programming fundamentals: variables, data types, control structures, loops, object-oriented programming (classes, objects, methods), exception handling, and version control with Git and GitHub for team collaboration.</li>\n  <li><strong>FTC Training:</strong> Comprehensive FIRST Tech Challenge programming: OnBot Java development (hardware control, sensors, teleop, autonomous), Android Studio advanced programming (PID control, odometry, path planning, motion profiling), and professional debugging practices.</li>\n  <li><strong>FRC Training:</strong> Master comprehensive FRC programming: environment setup, command-based architecture, CTRE and REV hardware integration, control theory (PID, motion profiling, feedforward), pose estimation, path planning, and advanced tools like PathPlanner and AdvantageKit for competitive robotics.</li>\n  <li><strong>Competitive Training:</strong> Develop algorithmic problem-solving skills: data structures (arrays, trees, graphs, hash tables), algorithms (sorting, searching, dynamic programming, greedy), Big O analysis, interview preparation, and competition strategies for coding contests.</li>\n</ul>"
    },
    {
      "type": "text",
      "title": "How to Navigate:",
      "content": "Click on any of the training sections above to explore that area. Each section contains multiple lessons that you can access through the sidebar navigation. We recommend starting with Java Training if you're new to programming, or jumping directly to your specific competition type if you have prior experience."
    },
    {
      "type": "link-grid",
      "title": "Contributors:",
      "links": [
        {
          "label": "Squirrr (Abdullah Khaled)",
          "url": "https://github.com/Squirrr"
        },
        {
          "label": "TheAilurusFulgens (Abdur-Rehman Naveed)",
          "url": "https://github.com/TheAilurusFulgens"
        }
      ]
    }
  ],
  "metadata": {
    "version": "2.0.0",
    "lastUpdated": "2025-09-19",
    "totalSections": 5,
    "features": {
      "responsiveDesign": true,
      "searchFunctionality": true,
      "themeSupport": true,
      "progressiveLearning": true
    }
  }
}